src/main/resources/request/SendCreatePatientRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:ref="http://schemas.consiliumtechnologies.com/mobile/2013/07/ReferralsMessages.xsd" xmlns:ref1="http://schemas.consiliumtechnologies.com/mobile/2013/07/ReferralsTypes.xsd" xmlns:vis="http://schemas.consiliumtechnologies.com/mobile/2009/03/VisitsTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendCreatePatientRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:CreatePatientRequest>
                <ref:Patient>
                    <!--Optional:-->
                    <ref1:Title>?</ref1:Title>
                    <!--Optional:-->
                    <ref1:Surname>?</ref1:Surname>
                    <!--Optional:-->
                    <ref1:Forename>?</ref1:Forename>
                    <!--Optional:-->
                    <ref1:Address>
                        <!--Optional:-->
                        <ref1:Name>?</ref1:Name>
                        <!--Optional:-->
                        <ref1:Line1>?</ref1:Line1>
                        <!--Optional:-->
                        <ref1:Line2>?</ref1:Line2>
                        <!--Optional:-->
                        <ref1:Line3>?</ref1:Line3>
                        <!--Optional:-->
                        <ref1:Line4>?</ref1:Line4>
                        <!--Optional:-->
                        <ref1:Line5>?</ref1:Line5>
                        <!--Optional:-->
                        <ref1:PostCode>?</ref1:PostCode>
                        <!--Optional:-->
                        <ref1:KeySafe>?</ref1:KeySafe>
                    </ref1:Address>
                    <!--Optional:-->
                    <ref1:Phone>
                        <!--Optional:-->
                        <ref1:Daytime>?</ref1:Daytime>
                        <!--Optional:-->
                        <ref1:Evening>?</ref1:Evening>
                        <!--Optional:-->
                        <ref1:Mobile>?</ref1:Mobile>
                    </ref1:Phone>
                    <!--Optional:-->
                    <ref1:Email>?</ref1:Email>
                    <ref1:Identity>
                        <ref1:NhsNumber>?</ref1:NhsNumber>
                        <ref1:ClientId>?</ref1:ClientId>
                    </ref1:Identity>
                    <!--Optional:-->
                    <ref1:TemporaryNHSNumber>?</ref1:TemporaryNHSNumber>
                    <!--Optional:-->
                    <ref1:KnownAs>?</ref1:KnownAs>
                    <!--Optional:-->
                    <ref1:AddressFrom>?</ref1:AddressFrom>
                    <!--Optional:-->
                    <ref1:CurrentlyResiding>
                        <!--Optional:-->
                        <ref1:Name>?</ref1:Name>
                        <!--Optional:-->
                        <ref1:Line1>?</ref1:Line1>
                        <!--Optional:-->
                        <ref1:Line2>?</ref1:Line2>
                        <!--Optional:-->
                        <ref1:Line3>?</ref1:Line3>
                        <!--Optional:-->
                        <ref1:Line4>?</ref1:Line4>
                        <!--Optional:-->
                        <ref1:Line5>?</ref1:Line5>
                        <!--Optional:-->
                        <ref1:PostCode>?</ref1:PostCode>
                        <!--Optional:-->
                        <ref1:KeySafe>?</ref1:KeySafe>
                    </ref1:CurrentlyResiding>
                    <!--Optional:-->
                    <ref1:MaritalStatus>?</ref1:MaritalStatus>
                    <!--Optional:-->
                    <ref1:Gender>?</ref1:Gender>
                    <!--Optional:-->
                    <ref1:DateOfBirth>?</ref1:DateOfBirth>
                    <!--Optional:-->
                    <ref1:DateOfDeath>?</ref1:DateOfDeath>
                    <!--Optional:-->
                    <ref1:Religion>?</ref1:Religion>
                    <!--Optional:-->
                    <ref1:Ethnicity>?</ref1:Ethnicity>
                    <!--Optional:-->
                    <ref1:FirstLanguage>?</ref1:FirstLanguage>
                    <!--Optional:-->
                    <ref1:LivesAlone>?</ref1:LivesAlone>
                    <!--Optional:-->
                    <ref1:Practitioner>
                        <ref1:Code>?</ref1:Code>
                        <!--Optional:-->
                        <ref1:Name>?</ref1:Name>
                        <ref1:PracticeCode>?</ref1:PracticeCode>
                        <!--Optional:-->
                        <ref1:PracticeName>?</ref1:PracticeName>
                        <!--Optional:-->
                        <ref1:Address>
                            <!--Optional:-->
                            <ref1:Name>?</ref1:Name>
                            <!--Optional:-->
                            <ref1:Line1>?</ref1:Line1>
                            <!--Optional:-->
                            <ref1:Line2>?</ref1:Line2>
                            <!--Optional:-->
                            <ref1:Line3>?</ref1:Line3>
                            <!--Optional:-->
                            <ref1:Line4>?</ref1:Line4>
                            <!--Optional:-->
                            <ref1:Line5>?</ref1:Line5>
                            <!--Optional:-->
                            <ref1:PostCode>?</ref1:PostCode>
                            <!--Optional:-->
                            <ref1:KeySafe>?</ref1:KeySafe>
                        </ref1:Address>
                        <!--Optional:-->
                        <ref1:Phone>?</ref1:Phone>
                        <!--Optional:-->
                        <ref1:Email>?</ref1:Email>
                    </ref1:Practitioner>
                    <!--Optional:-->
                    <ref1:Nationality>?</ref1:Nationality>
                    <!--Optional:-->
                    <ref1:Interpreter>?</ref1:Interpreter>
                    <!--Optional:-->
                    <ref1:SmsConsent>?</ref1:SmsConsent>
                    <!--Optional:-->
                    <ref1:Allergies>
                        <!--Zero or more repetitions:-->
                        <ref1:Item>
                            <ref1:Name>?</ref1:Name>
                            <!--Optional:-->
                            <ref1:Reaction>?</ref1:Reaction>
                            <!--Optional:-->
                            <ref1:Comments>?</ref1:Comments>
                        </ref1:Item>
                    </ref1:Allergies>
                    <!--Optional:-->
                    <ref1:Contacts>
                        <!--Zero or more repetitions:-->
                        <ref1:Item>
                            <!--Optional:-->
                            <ref1:Title>?</ref1:Title>
                            <!--Optional:-->
                            <ref1:Surname>?</ref1:Surname>
                            <!--Optional:-->
                            <ref1:Forename>?</ref1:Forename>
                            <!--Optional:-->
                            <ref1:Address>
                                <!--Optional:-->
                                <ref1:Name>?</ref1:Name>
                                <!--Optional:-->
                                <ref1:Line1>?</ref1:Line1>
                                <!--Optional:-->
                                <ref1:Line2>?</ref1:Line2>
                                <!--Optional:-->
                                <ref1:Line3>?</ref1:Line3>
                                <!--Optional:-->
                                <ref1:Line4>?</ref1:Line4>
                                <!--Optional:-->
                                <ref1:Line5>?</ref1:Line5>
                                <!--Optional:-->
                                <ref1:PostCode>?</ref1:PostCode>
                                <!--Optional:-->
                                <ref1:KeySafe>?</ref1:KeySafe>
                            </ref1:Address>
                            <!--Optional:-->
                            <ref1:Phone>
                                <!--Optional:-->
                                <ref1:Daytime>?</ref1:Daytime>
                                <!--Optional:-->
                                <ref1:Evening>?</ref1:Evening>
                                <!--Optional:-->
                                <ref1:Mobile>?</ref1:Mobile>
                            </ref1:Phone>
                            <!--Optional:-->
                            <ref1:Email>?</ref1:Email>
                            <ref1:Type>?</ref1:Type>
                            <!--Optional:-->
                            <ref1:Relationship>?</ref1:Relationship>
                        </ref1:Item>
                    </ref1:Contacts>
                    <!--Optional:-->
                    <ref1:HomeCareConsent>?</ref1:HomeCareConsent>
                    <!--Optional:-->
                    <ref1:MultipleResources>?</ref1:MultipleResources>
                    <!--Optional:-->
                    <ref1:Notes>?</ref1:Notes>
                    <!--Optional:-->
                    <ref1:AdditionalProperties>
                        <!--Zero or more repetitions:-->
                        <vis:AdditionalProperty>
                            <vis:Name>?</vis:Name>
                            <vis:Value>?</vis:Value>
                            <!--Optional:-->
                            <vis:AdditionalProperties/>
                        </vis:AdditionalProperty>
                    </ref1:AdditionalProperties>
                </ref:Patient>
            </mes:CreatePatientRequest>
        </mes:SendCreatePatientRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>